---
kind: type
id: T:Autodesk.Revit.DB.PrimarySizeCriterion
source: html/995cd666-6b07-2c7d-9052-6a36be3f7ed8.htm
---
# Autodesk.Revit.DB.PrimarySizeCriterion

This class contains a size criterion for a RoutingPreferenceRule.

## Syntax (C#)
```csharp
public class PrimarySizeCriterion : RoutingCriterionBase
```